In [1]:
import pandas as pd

In [2]:
df_temp = pd.DataFrame({

    "city":["Mumbai","Pune","Delhi","Gurgaon","Bangaluru"],
    "temp":[28,32,24,22,15]
})
df_temp

        city  temp
0     Mumbai    28
1       Pune    32
2      Delhi    24
3    Gurgaon    22
4  Bangaluru    15

In [7]:
df_aqi = pd.DataFrame({

    "city":["Gurgaon","Hyderabad","Mumbai","Delhi","Bangaluru","Pune","Nashik"],
    "aqi":[205,170,155,605,355,190,112]
})
df_aqi

        city  aqi
0    Gurgaon  205
1  Hyderabad  170
2     Mumbai  155
3      Delhi  605
4  Bangaluru  355
5       Pune  190
6     Nashik  112

In [8]:
# merge
pd.merge(df_temp,df_aqi,on="city")

        city  temp  aqi
0     Mumbai    28  155
1       Pune    32  190
2      Delhi    24  605
3    Gurgaon    22  205
4  Bangaluru    15  355

In [9]:
# Types of Join
pd.merge(df_aqi, df_temp,on="city")

        city  aqi  temp
0    Gurgaon  205    22
1     Mumbai  155    28
2      Delhi  605    24
3  Bangaluru  355    15
4       Pune  190    32

In [10]:
# Types of Join
pd.merge(df_aqi, df_temp,on="city", how="left")

        city  aqi  temp
0    Gurgaon  205  22.0
1  Hyderabad  170   NaN
2     Mumbai  155  28.0
3      Delhi  605  24.0
4  Bangaluru  355  15.0
5       Pune  190  32.0
6     Nashik  112   NaN

In [11]:
# Types of Join
pd.merge(df_aqi, df_temp,on="city", how="right")

        city  aqi  temp
0     Mumbai  155    28
1       Pune  190    32
2      Delhi  605    24
3    Gurgaon  205    22
4  Bangaluru  355    15

In [12]:
df_temp = pd.DataFrame({

    "city":["Mumbai","Pune","Delhi","Gurgaon","Bangaluru"],
    "temp":[28,32,24,22,15]
})
df_temp

        city  temp
0     Mumbai    28
1       Pune    32
2      Delhi    24
3    Gurgaon    22
4  Bangaluru    15

In [13]:
df_aqi = pd.DataFrame({

    "town":["Gurgaon","Hyderabad","Mumbai","Delhi","Bangaluru","Pune","Nashik"],
    "aqi":[205,170,155,605,355,190,112]
})
df_aqi

        town  aqi
0    Gurgaon  205
1  Hyderabad  170
2     Mumbai  155
3      Delhi  605
4  Bangaluru  355
5       Pune  190
6     Nashik  112

In [18]:
# Types of Join
pd.merge(df_aqi, df_temp,left_on="town", right_on="city", how="left")

        town  aqi       city  temp
0    Gurgaon  205    Gurgaon  22.0
1  Hyderabad  170        NaN   NaN
2     Mumbai  155     Mumbai  28.0
3      Delhi  605      Delhi  24.0
4  Bangaluru  355  Bangaluru  15.0
5       Pune  190       Pune  32.0
6     Nashik  112        NaN   NaN

In [17]:
# Types of Join
pd.merge(df_aqi, df_temp, how="cross")

         town  aqi       city  temp
0     Gurgaon  205     Mumbai    28
1     Gurgaon  205       Pune    32
2     Gurgaon  205      Delhi    24
3     Gurgaon  205    Gurgaon    22
4     Gurgaon  205  Bangaluru    15
5   Hyderabad  170     Mumbai    28
6   Hyderabad  170       Pune    32
7   Hyderabad  170      Delhi    24
8   Hyderabad  170    Gurgaon    22
9   Hyderabad  170  Bangaluru    15
10     Mumbai  155     Mumbai    28
11     Mumbai  155       Pune    32
12     Mumbai  155      Delhi    24
13     Mumbai  155    Gurgaon    22
14     Mumbai  155  Bangaluru    15
15      Delhi  605     Mumbai    28
16      Delhi  605       Pune    32
17      Delhi  605      Delhi    24
18      Delhi  605    Gurgaon    22
19      Delhi  605  Bangaluru    15
20  Bangaluru  355     Mumbai    28
21  Bangaluru  355       Pune    32
22  Bangaluru  355      Delhi    24
23  Bangaluru  355    Gurgaon    22
24  Bangaluru  355  Bangaluru    15
25       Pune  190     Mumbai    28
26       Pune  190       Pune    32
27       Pune  190      Delhi    24
28       Pune  190    Gurgaon    22
29       Pune  190  Bangaluru    15
30     Nashik  112     Mumbai    28
31     Nashik  112       Pune    32
32     Nashik  112      Delhi    24
33     Nashik  112    Gurgaon    22
34     Nashik  112  Bangaluru    15

In [19]:
# Types of Join
pd.merge(df_aqi, df_temp, how="cross").shape

(35, 4)